[
    {
        "picture": "https://bit.ly/3fppRll",
        "description": "When you get two bodybuilders like Kris Gethin and IFBB pro Branch Warren together in the same gym to train arms, you're bound to witness and soak in some no-fluff training wisdom.Both guys admit there are endless ways to approach your workouts in terms of load and intensity. With years of training and experimenting under both their lifting belts, they've found exactly what yields the best results for them—and today they're focusing strictly on arms.",
        "name": "Terra Sanders",
        "age": "20-25",
        "time": 20
    },
    {
        "picture": "https://bit.ly/3SKtwJ3",
        "description": "You may think you know all there is to know about training arms with supersets. Trust me, you don't. I don't either, which is why last year, I saw the need to bring my arms up. I felt the same way about my delts, as I explained in my last article, Kris Gethin's High-Volume Shoulder Builder.The way I attacked my biceps is similar to how to how I tackled with my delts, and it proved similarly effective. First of all, I trained them every five days—effectively twice a week—rather than weekly. I also bumped up my calories to support muscle growth, and prioritized supplements that boost growth and strength gains.",
        "name": "Jewell Hayden",
        "age": "25-30",
        "time": 30
    },
    {
        "picture": "https://bit.ly/3BVevwY",
        "description": "He won 11 pro contests, finished third in the Olympia twice (1999, 2002), and was second in the Arnold Classic six years in a row (2000–05). Still, for those, like yours truly, who saw his workouts in the Mecca, it’s the numbers he put up—especially on chest and legs—that were truly scary.He incline-pressed 525 for two and 405 for 12 (halting each rep about three inches above his chest). He did 1,200-pound leg presses for 30, 900-pound reverse hack squats for 10, and 675-pound squats without even a belt—proving he was “the Real Deal.”",
        "name": "Keith Haney",
        "age": "30-35",
        "time": 40
    },
    {
        "picture": "https://bit.ly/3ShNvPg",
        "description": "Although he was only 5’5″ and about 185 pounds, the two-time Mr. Olympia’s (1976, 1981) best-reported lifts were a 750 deadlift, a 665 squat, a 525 bench press, and a 400 clean and jerk. While these numbers are tough to verify, there is photographic evidence.The Sardinian Strongman also bent half-inch steel bars, blew up hot-water bottles until they exploded, and deadlifted cars. In 1977, he was fifth in the inaugural World’s Strongest Man behind four giants who each outweighed him by around 100 pounds.",
        "name": "Darla Figueroa",
        "age": "35-40",
        "time": 50
    },
    {
        "picture": "https://bit.ly/3E1G4Yk",
        "description": "As a bodybuilder, Jackson has racked up seven victories, including first place at both the 2017 Arnold Classic South Africa and the Toronto Pro. And though he started powerlifting after bodybuilding, he was soon triumphing at both.Three weeks before he won the 2001 NPC Nationals, Jackson set the deadlift world record in the 220-pound class at 814 pounds. The 47-year-old has totaled 2,127 pounds in competition, including a 540 bench press and 826 squat.",
        "name": "Guzman Hinton",
        "age": "40-45",
        "time": 60
    },
    {
        "picture": "https://bit.ly/3RlskdK",
        "description": "Unlike the other eight on our list, Efferding is better known as a powerlifter than a bodybuilder. That’s why it may surprise you that he did his first physique contest way back in 1988, eight years before his initial powerlifting meet. After nine years away from competitions, he returned to both sports in his 40s. And it was then that he really excelled.He won the 2009 Masters title, securing IFBB Pro League status, and landed in single digits (ninth) in the 2011 FLEX Pro. Meanwhile, he established himself as the premier raw powerlifter in the world. Efferding was uniquely strong in all three lifts—his official raw powerlifting marks include a 606 bench press, an 865 squat, and an 837 deadlift.",
        "name": "Morrow Spencer",
        "age": "45-50",
        "time": 70
    }
]